OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j94.h
extern __at(0x0E11) __sfr UCFG;

typedef union
  {
  struct
    {
    unsigned PPB0               : 1;
    unsigned PPB1               : 1;
    unsigned FSEN               : 1;
    unsigned UTRDIS             : 1;
    unsigned UPUEN              : 1;
    unsigned                    : 1;
    unsigned UOEMON             : 1;
    unsigned UTEYE              : 1;
    };

  struct
    {
    unsigned PPB                : 2;
    unsigned                    : 6;
    };
  } __UCFGbits_t;

extern __at(0x0E11) volatile __UCFGbits_t UCFGbits;

#define _PPB0                   0x01
#define _PPB1                   0x02
#define _FSEN                   0x04
#define _UTRDIS                 0x08
#define _UPUEN                  0x10
#define _UOEMON                 0x40
#define _UTEYE                  0x80

//==============================================================================


//==============================================================================
//        RPOR0_1 Bits

extern __at(0x0E12) __sfr RPOR0_1;

typedef union
  {
  struct
    {
    unsigned RPO0R0             : 1;
    unsigned RPO0R1             : 1;
    unsigned RPO0R2             : 1;
    unsigned RPO0R3             : 1;
    unsigned RPO1R0             : 1;
    unsigned RPO1R1             : 1;
    unsigned RPO1R2             : 1;
    unsigned RPO1R3             : 1;
    };

  struct
    {
    unsigned RPO0R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO1R              : 4;
    };
  } __RPOR0_1bits_t;

extern __at(0x0E12) volatile __RPOR0_1bits_t RPOR0_1bits;

#define _RPO0R0                 0x01
#define _RPO0R1                 0x02
#define _RPO0R2                 0x04
#define _RPO0R3                 0x08
#define _RPO1R0                 0x10
#define _RPO1R1                 0x20
#define _RPO1R2                 0x40
#define _RPO1R3                 0x80

//==============================================================================


//==============================================================================
//        RPOR2_3 Bits

extern __at(0x0E13) __sfr RPOR2_3;

typedef union
  {
  struct
    {
    unsigned RPO2R0             : 1;
    unsigned RPO2R1             : 1;
    unsigned RPO2R2             : 1;
    unsigned RPO2R3             : 1;
    unsigned RPO3R0             : 1;
    unsigned RPO3R1             : 1;
    unsigned RPO3R2             : 1;
    unsigned RPO3R3             : 1;
    };

  struct
    {
    unsigned RPO2R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO3R              : 4;
    };
  } __RPOR2_3bits_t;

extern __at(0x0E13) volatile __RPOR2_3bits_t RPOR2_3bits;

#define _RPO2R0                 0x01
#define _RPO2R1                 0x02
#define _RPO2R2                 0x04
#define _RPO2R3                 0x08
#define _RPO3R0                 0x10
#define _RPO3R1                 0x20
#define _RPO3R2                 0x40
#define _RPO3R3                 0x80

//==============================================================================


//==============================================================================
//        RPOR4_5 Bits

extern __at(0x0E14) __sfr RPOR4_5;

typedef union
  {
  struct
    {
    unsigned RPO4R0             : 1;
    unsigned RPO4R1             : 1;
    unsigned RPO4R2             : 1;
    unsigned RPO4R3             : 1;
    unsigned RPO5R0             : 1;
    unsigned RPO5R1             : 1;
    unsigned RPO5R2             : 1;
    unsigned RPO5R3             : 1;
    };

  struct
    {
    unsigned RPO4R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO5R              : 4;
    };
  } __RPOR4_5bits_t;

extern __at(0x0E14) volatile __RPOR4_5bits_t RPOR4_5bits;

#define _RPO4R0                 0x01
#define _RPO4R1                 0x02
#define _RPO4R2                 0x04
#define _RPO4R3                 0x08
#define _RPO5R0                 0x10
#define _RPO5R1                 0x20
#define _RPO5R2                 0x40
#define _RPO5R3                 0x80

//==============================================================================


//==============================================================================
//        RPOR6_7 Bits

extern __at(0x0E15) __sfr RPOR6_7;

typedef union
  {
  struct
    {
    unsigned RPO6R0             : 1;
    unsigned RPO6R1             : 1;
    unsigned RPO6R2             : 1;
    unsigned RPO6R3             : 1;
    unsigned RPO7R0             : 1;
    unsigned RPO7R1             : 1;
    unsigned RPO7R2             : 1;
    unsigned RPO7R3             : 1;
    };

  struct
    {
    unsigned RPO6R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO7R              : 4;
    };
  } __RPOR6_7bits_t;

extern __at(0x0E15) volatile __RPOR6_7bits_t RPOR6_7bits;

#define _RPO6R0                 0x01
#define _RPO6R1                 0x02
#define _RPO6R2                 0x04
#define _RPO6R3                 0x08
#define _RPO7R0                 0x10
#define _RPO7R1                 0x20
#define _RPO7R2                 0x40
#define _RPO7R3                 0x80

//==============================================================================


//==============================================================================
//        RPOR8_9 Bits

extern __at(0x0E16) __sfr RPOR8_9;

typedef union
  {
  struct
    {
    unsigned RPO8R0             : 1;
    unsigned RPO8R1             : 1;
    unsigned RPO8R2             : 1;
    unsigned RPO8R3             : 1;
    unsigned RPO9R0             : 1;
    unsigned RPO9R1             : 1;
    unsigned RPO9R2             : 1;
    unsigned RPO9R3             : 1;
    };

  struct
    {
    unsigned RPO8R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO9R              : 4;
    };
  } __RPOR8_9bits_t;

extern __at(0x0E16) volatile __RPOR8_9bits_t RPOR8_9bits;

