OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j94.h
#define _RPO8R0                 0x01
#define _RPO8R1                 0x02
#define _RPO8R2                 0x04
#define _RPO8R3                 0x08
#define _RPO9R0                 0x10
#define _RPO9R1                 0x20
#define _RPO9R2                 0x40
#define _RPO9R3                 0x80

//==============================================================================


//==============================================================================
//        RPOR10_11 Bits

extern __at(0x0E17) __sfr RPOR10_11;

typedef union
  {
  struct
    {
    unsigned RPO10R0            : 1;
    unsigned RPO10R1            : 1;
    unsigned RPO10R2            : 1;
    unsigned RPO10R3            : 1;
    unsigned RPO11R0            : 1;
    unsigned RPO11R1            : 1;
    unsigned RPO11R2            : 1;
    unsigned RPO11R3            : 1;
    };

  struct
    {
    unsigned RPO10R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO11R             : 4;
    };
  } __RPOR10_11bits_t;

extern __at(0x0E17) volatile __RPOR10_11bits_t RPOR10_11bits;

#define _RPO10R0                0x01
#define _RPO10R1                0x02
#define _RPO10R2                0x04
#define _RPO10R3                0x08
#define _RPO11R0                0x10
#define _RPO11R1                0x20
#define _RPO11R2                0x40
#define _RPO11R3                0x80

//==============================================================================


//==============================================================================
//        RPOR12_13 Bits

extern __at(0x0E18) __sfr RPOR12_13;

typedef union
  {
  struct
    {
    unsigned RPO12R0            : 1;
    unsigned RPO12R1            : 1;
    unsigned RPO12R2            : 1;
    unsigned RPO12R3            : 1;
    unsigned RPO13R0            : 1;
    unsigned RPO13R1            : 1;
    unsigned RPO13R2            : 1;
    unsigned RPO13R3            : 1;
    };

  struct
    {
    unsigned RPO12R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO13R             : 4;
    };
  } __RPOR12_13bits_t;

extern __at(0x0E18) volatile __RPOR12_13bits_t RPOR12_13bits;

#define _RPO12R0                0x01
#define _RPO12R1                0x02
#define _RPO12R2                0x04
#define _RPO12R3                0x08
#define _RPO13R0                0x10
#define _RPO13R1                0x20
#define _RPO13R2                0x40
#define _RPO13R3                0x80

//==============================================================================


//==============================================================================
//        RPOR14_15 Bits

extern __at(0x0E19) __sfr RPOR14_15;

typedef union
  {
  struct
    {
    unsigned RPO14R0            : 1;
    unsigned RPO14R1            : 1;
    unsigned RPO14R2            : 1;
    unsigned RPO14R3            : 1;
    unsigned RPO15R0            : 1;
    unsigned RPO15R1            : 1;
    unsigned RPO15R2            : 1;
    unsigned RPO15R3            : 1;
    };

  struct
    {
    unsigned RPO14R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO15R             : 4;
    };
  } __RPOR14_15bits_t;

extern __at(0x0E19) volatile __RPOR14_15bits_t RPOR14_15bits;

#define _RPO14R0                0x01
#define _RPO14R1                0x02
#define _RPO14R2                0x04
#define _RPO14R3                0x08
#define _RPO15R0                0x10
#define _RPO15R1                0x20
#define _RPO15R2                0x40
#define _RPO15R3                0x80

//==============================================================================


//==============================================================================
//        RPOR16_17 Bits

extern __at(0x0E1A) __sfr RPOR16_17;

typedef union
  {
  struct
    {
    unsigned RPO16R0            : 1;
    unsigned RPO16R1            : 1;
    unsigned RPO16R2            : 1;
    unsigned RPO16R3            : 1;
    unsigned RPO17R0            : 1;
    unsigned RPO17R1            : 1;
    unsigned RPO17R2            : 1;
    unsigned RPO17R3            : 1;
    };

  struct
    {
    unsigned RPO16R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO17R             : 4;
    };
  } __RPOR16_17bits_t;

extern __at(0x0E1A) volatile __RPOR16_17bits_t RPOR16_17bits;

#define _RPO16R0                0x01
#define _RPO16R1                0x02
#define _RPO16R2                0x04
#define _RPO16R3                0x08
#define _RPO17R0                0x10
#define _RPO17R1                0x20
#define _RPO17R2                0x40
#define _RPO17R3                0x80

//==============================================================================


//==============================================================================
//        RPOR18_19 Bits

extern __at(0x0E1B) __sfr RPOR18_19;

typedef union
  {
  struct
    {
    unsigned RPO18R0            : 1;
    unsigned RPO18R1            : 1;
    unsigned RPO18R2            : 1;
    unsigned RPO18R3            : 1;
    unsigned RPO19R0            : 1;
    unsigned RPO19R1            : 1;
    unsigned RPO19R2            : 1;
    unsigned RPO19R3            : 1;
    };

  struct
    {
    unsigned RPO18R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO19R             : 4;
    };
  } __RPOR18_19bits_t;

extern __at(0x0E1B) volatile __RPOR18_19bits_t RPOR18_19bits;

#define _RPO18R0                0x01
#define _RPO18R1                0x02
#define _RPO18R2                0x04
#define _RPO18R3                0x08
#define _RPO19R0                0x10
#define _RPO19R1                0x20
#define _RPO19R2                0x40
#define _RPO19R3                0x80

//==============================================================================


//==============================================================================
//        RPOR20_21 Bits

extern __at(0x0E1C) __sfr RPOR20_21;

typedef union
  {
  struct
    {
    unsigned RPO20R0            : 1;
    unsigned RPO20R1            : 1;
    unsigned RPO20R2            : 1;
    unsigned RPO20R3            : 1;
    unsigned RPO21R0            : 1;
    unsigned RPO21R1            : 1;
    unsigned RPO21R2            : 1;
    unsigned RPO21R3            : 1;
    };

  struct
    {
    unsigned RPO20R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO21R             : 4;
    };
  } __RPOR20_21bits_t;

extern __at(0x0E1C) volatile __RPOR20_21bits_t RPOR20_21bits;

