OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j94.h
extern __at(0x0E87) volatile __ADCHS0Hbits_t ADCHS0Hbits;

#define _CH0SB0                 0x01
#define _CH0SB1                 0x02
#define _CH0SB2                 0x04
#define _CH0SB3                 0x08
#define _CH0SB4                 0x10
#define _CH0NB0                 0x20
#define _CH0NB1                 0x40
#define _CH0NB2                 0x80

//==============================================================================


//==============================================================================
//        ADCON5L Bits

extern __at(0x0E88) __sfr ADCON5L;

typedef union
  {
  struct
    {
    unsigned CM0                : 1;
    unsigned CM1                : 1;
    unsigned WM0                : 1;
    unsigned WM1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CM                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned WM                 : 2;
    unsigned                    : 4;
    };
  } __ADCON5Lbits_t;

extern __at(0x0E88) volatile __ADCON5Lbits_t ADCON5Lbits;

#define _CM0                    0x01
#define _CM1                    0x02
#define _WM0                    0x04
#define _WM1                    0x08

//==============================================================================


//==============================================================================
//        ADCON5H Bits

extern __at(0x0E89) __sfr ADCON5H;

typedef union
  {
  struct
    {
    unsigned ASINTMD0           : 1;
    unsigned ASINTMD1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CTMUREQ            : 1;
    unsigned LPENA              : 1;
    unsigned ASENA              : 1;
    };

  struct
    {
    unsigned ASINTMD            : 2;
    unsigned                    : 6;
    };
  } __ADCON5Hbits_t;

extern __at(0x0E89) volatile __ADCON5Hbits_t ADCON5Hbits;

#define _ASINTMD0               0x01
#define _ASINTMD1               0x02
#define _CTMUREQ                0x20
#define _LPENA                  0x40
#define _ASENA                  0x80

//==============================================================================


//==============================================================================
//        ADCON3L Bits

extern __at(0x0E8A) __sfr ADCON3L;

typedef struct
  {
  unsigned ADCS0                : 1;
  unsigned ADCS1                : 1;
  unsigned ADCS2                : 1;
  unsigned ADCS3                : 1;
  unsigned ADCS4                : 1;
  unsigned ADCS5                : 1;
  unsigned ADCS6                : 1;
  unsigned ADCS7                : 1;
  } __ADCON3Lbits_t;

extern __at(0x0E8A) volatile __ADCON3Lbits_t ADCON3Lbits;

#define _ADCS0                  0x01
#define _ADCS1                  0x02
#define _ADCS2                  0x04
#define _ADCS3                  0x08
#define _ADCS4                  0x10
#define _ADCS5                  0x20
#define _ADCS6                  0x40
#define _ADCS7                  0x80

//==============================================================================


//==============================================================================
//        ADCON3H Bits

extern __at(0x0E8B) __sfr ADCON3H;

typedef union
  {
  struct
    {
    unsigned SAMC0              : 1;
    unsigned SAMC1              : 1;
    unsigned SAMC2              : 1;
    unsigned SAMC3              : 1;
    unsigned SAMC4              : 1;
    unsigned PUMPEN             : 1;
    unsigned EXTSAM             : 1;
    unsigned ADRC               : 1;
    };

  struct
    {
    unsigned SAMC               : 5;
    unsigned                    : 3;
    };
  } __ADCON3Hbits_t;

extern __at(0x0E8B) volatile __ADCON3Hbits_t ADCON3Hbits;

#define _SAMC0                  0x01
#define _SAMC1                  0x02
#define _SAMC2                  0x04
#define _SAMC3                  0x08
#define _SAMC4                  0x10
#define _PUMPEN                 0x20
#define _EXTSAM                 0x40
#define _ADRC                   0x80

//==============================================================================


//==============================================================================
//        ADCON2L Bits

extern __at(0x0E8C) __sfr ADCON2L;

typedef union
  {
  struct
    {
    unsigned ALTS               : 1;
    unsigned BUFM               : 1;
    unsigned SMPI0              : 1;
    unsigned SMPI1              : 1;
    unsigned SMPI2              : 1;
    unsigned SMPI3              : 1;
    unsigned SMPI4              : 1;
    unsigned BUFS               : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned SMPI               : 5;
    unsigned                    : 1;
    };
  } __ADCON2Lbits_t;

extern __at(0x0E8C) volatile __ADCON2Lbits_t ADCON2Lbits;

#define _ALTS                   0x01
#define _BUFM                   0x02
#define _SMPI0                  0x04
#define _SMPI1                  0x08
#define _SMPI2                  0x10
#define _SMPI3                  0x20
#define _SMPI4                  0x40
#define _BUFS                   0x80

//==============================================================================


//==============================================================================
//        ADCON2H Bits

extern __at(0x0E8D) __sfr ADCON2H;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CSCNA              : 1;
    unsigned BUFREGEN           : 1;
    unsigned OFFCAL             : 1;
    unsigned NVCFG0             : 1;
    unsigned PVCFG0             : 1;
    unsigned PVCFG1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PVCFG              : 2;
    };
  } __ADCON2Hbits_t;

extern __at(0x0E8D) volatile __ADCON2Hbits_t ADCON2Hbits;

#define _CSCNA                  0x04
#define _BUFREGEN               0x08
#define _OFFCAL                 0x10
#define _NVCFG0                 0x20
#define _PVCFG0                 0x40
#define _PVCFG1                 0x80

//==============================================================================


//==============================================================================
//        LCDDATA0 Bits

extern __at(0x0E8E) __sfr LCDDATA0;

typedef struct
  {
  unsigned S00C0                : 1;
  unsigned S01C0                : 1;
  unsigned S02C0                : 1;
  unsigned S03C0                : 1;
  unsigned S04C0                : 1;
  unsigned S05C0                : 1;
  unsigned S06C0                : 1;
  unsigned S07C0                : 1;
  } __LCDDATA0bits_t;

extern __at(0x0E8E) volatile __LCDDATA0bits_t LCDDATA0bits;

#define _S00C0                  0x01
#define _S01C0                  0x02
#define _S02C0                  0x04
#define _S03C0                  0x08
#define _S04C0                  0x10
#define _S05C0                  0x20
#define _S06C0                  0x40
#define _S07C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA1 Bits

extern __at(0x0E8F) __sfr LCDDATA1;

typedef struct
  {
  unsigned S08C0                : 1;
  unsigned S09C0                : 1;
  unsigned S10C0                : 1;
  unsigned S11C0                : 1;
  unsigned S12C0                : 1;
  unsigned S13C0                : 1;
  unsigned S14C0                : 1;
  unsigned S15C0                : 1;
  } __LCDDATA1bits_t;

extern __at(0x0E8F) volatile __LCDDATA1bits_t LCDDATA1bits;

