OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f96j94.h
extern __at(0x0FB7) __sfr PIE5;

typedef struct
  {
  unsigned TMR4IE               : 1;
  unsigned TMR5IE               : 1;
  unsigned TMR6IE               : 1;
  unsigned                      : 1;
  unsigned TMR8IE               : 1;
  unsigned ACTLOCKIE            : 1;
  unsigned ACTORSIE             : 1;
  unsigned                      : 1;
  } __PIE5bits_t;

extern __at(0x0FB7) volatile __PIE5bits_t PIE5bits;

#define _TMR4IE                 0x01
#define _TMR5IE                 0x02
#define _TMR6IE                 0x04
#define _TMR8IE                 0x10
#define _ACTLOCKIE              0x20
#define _ACTORSIE               0x40

//==============================================================================


//==============================================================================
//        PIR5 Bits

extern __at(0x0FB8) __sfr PIR5;

typedef struct
  {
  unsigned TMR4IF               : 1;
  unsigned TMR5IF               : 1;
  unsigned TMR6IF               : 1;
  unsigned                      : 1;
  unsigned TMR8IF               : 1;
  unsigned ACTLOCKIF            : 1;
  unsigned ACTORSIF             : 1;
  unsigned                      : 1;
  } __PIR5bits_t;

extern __at(0x0FB8) volatile __PIR5bits_t PIR5bits;

#define _TMR4IF                 0x01
#define _TMR5IF                 0x02
#define _TMR6IF                 0x04
#define _TMR8IF                 0x10
#define _ACTLOCKIF              0x20
#define _ACTORSIF               0x40

//==============================================================================


//==============================================================================
//        CCP1CON Bits

extern __at(0x0FB9) __sfr CCP1CON;

typedef union
  {
  struct
    {
    unsigned CCP1M0             : 1;
    unsigned CCP1M1             : 1;
    unsigned CCP1M2             : 1;
    unsigned CCP1M3             : 1;
    unsigned DC1B0              : 1;
    unsigned DC1B1              : 1;
    unsigned P1M0               : 1;
    unsigned P1M1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP1Y              : 1;
    unsigned CCP1X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC1B               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned P1M                : 2;
    };
  } __CCP1CONbits_t;

extern __at(0x0FB9) volatile __CCP1CONbits_t CCP1CONbits;

#define _CCP1M0                 0x01
#define _CCP1M1                 0x02
#define _CCP1M2                 0x04
#define _CCP1M3                 0x08
#define _DC1B0                  0x10
#define _CCP1Y                  0x10
#define _DC1B1                  0x20
#define _CCP1X                  0x20
#define _P1M0                   0x40
#define _P1M1                   0x80

//==============================================================================

extern __at(0x0FBA) __sfr CCPR1;
extern __at(0x0FBA) __sfr CCPR1L;
extern __at(0x0FBB) __sfr CCPR1H;

//==============================================================================
//        ECCP1DEL Bits

extern __at(0x0FBC) __sfr ECCP1DEL;

typedef union
  {
  struct
    {
    unsigned P1DC0              : 1;
    unsigned P1DC1              : 1;
    unsigned P1DC2              : 1;
    unsigned P1DC3              : 1;
    unsigned P1DC4              : 1;
    unsigned P1DC5              : 1;
    unsigned P1DC6              : 1;
    unsigned P1RSEN             : 1;
    };

  struct
    {
    unsigned P1DC               : 7;
    unsigned                    : 1;
    };
  } __ECCP1DELbits_t;

extern __at(0x0FBC) volatile __ECCP1DELbits_t ECCP1DELbits;

#define _P1DC0                  0x01
#define _P1DC1                  0x02
#define _P1DC2                  0x04
#define _P1DC3                  0x08
#define _P1DC4                  0x10
#define _P1DC5                  0x20
#define _P1DC6                  0x40
#define _P1RSEN                 0x80

//==============================================================================


//==============================================================================
//        ECCP1AS Bits

extern __at(0x0FBD) __sfr ECCP1AS;

typedef union
  {
  struct
    {
    unsigned PSS1BD0            : 1;
    unsigned PSS1BD1            : 1;
    unsigned PSS1AC0            : 1;
    unsigned PSS1AC1            : 1;
    unsigned ECCP1AS0           : 1;
    unsigned ECCP1AS1           : 1;
    unsigned ECCP1AS2           : 1;
    unsigned ECCP1ASE           : 1;
    };

  struct
    {
    unsigned PSS1BD             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PSS1AC             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ECCP1AS            : 3;
    unsigned                    : 1;
    };
  } __ECCP1ASbits_t;

extern __at(0x0FBD) volatile __ECCP1ASbits_t ECCP1ASbits;

#define _PSS1BD0                0x01
#define _PSS1BD1                0x02
#define _PSS1AC0                0x04
#define _PSS1AC1                0x08
#define _ECCP1AS0               0x10
#define _ECCP1AS1               0x20
#define _ECCP1AS2               0x40
#define _ECCP1ASE               0x80

//==============================================================================


//==============================================================================
//        CVRCONL Bits

extern __at(0x0FBE) __sfr CVRCONL;

typedef union
  {
  struct
    {
    unsigned CVRNSS             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CVRPSS0            : 1;
    unsigned CVRPSS1            : 1;
    unsigned CVROE              : 1;
    unsigned CVREN              : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CVRPSS             : 2;
    unsigned                    : 2;
    };
  } __CVRCONLbits_t;

extern __at(0x0FBE) volatile __CVRCONLbits_t CVRCONLbits;

#define _CVRNSS                 0x01
#define _CVRPSS0                0x10
#define _CVRPSS1                0x20
#define _CVROE                  0x40
#define _CVREN                  0x80

//==============================================================================


//==============================================================================
//        CVRCONH Bits

extern __at(0x0FBF) __sfr CVRCONH;

typedef union
  {
  struct
    {
    unsigned CVR0               : 1;
    unsigned CVR1               : 1;
    unsigned CVR2               : 1;
    unsigned CVR3               : 1;
    unsigned CVR4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CVR                : 5;
    unsigned                    : 3;
    };
  } __CVRCONHbits_t;

extern __at(0x0FBF) volatile __CVRCONHbits_t CVRCONHbits;

#define _CVR0                   0x01
#define _CVR1                   0x02
#define _CVR2                   0x04
#define _CVR3                   0x08
#define _CVR4                   0x10

//==============================================================================


//==============================================================================
//        ADCON1L Bits

extern __at(0x0FC0) __sfr ADCON1L;

typedef union
  {
  struct
    {
    unsigned DONE               : 1;
    unsigned SAMP               : 1;
    unsigned ASAM               : 1;
    unsigned                    : 1;
    unsigned SSRC0              : 1;
    unsigned SSRC1              : 1;
    unsigned SSRC2              : 1;
    unsigned SSRC3              : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned SSRC               : 4;
    };
  } __ADCON1Lbits_t;

extern __at(0x0FC0) volatile __ADCON1Lbits_t ADCON1Lbits;

#define _DONE                   0x01
#define _SAMP                   0x02
#define _ASAM                   0x04
#define _SSRC0                  0x10
#define _SSRC1                  0x20
#define _SSRC2                  0x40
#define _SSRC3                  0x80

//==============================================================================


//==============================================================================
//        ADCON1H Bits

extern __at(0x0FC1) __sfr ADCON1H;

typedef union
  {
  struct
    {
    unsigned FORM0              : 1;
    unsigned FORM1              : 1;
    unsigned MODE12             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADON               : 1;
    };

  struct
    {
    unsigned FORM               : 2;
    unsigned                    : 6;
    };
  } __ADCON1Hbits_t;

extern __at(0x0FC1) volatile __ADCON1Hbits_t ADCON1Hbits;

